Охотники_и_рыболовы/src/DataProcessors/ЗагрузкаДанныхОхотников/ЗагрузкаДанныхОхотников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхОхотников</name>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/DataProcessors/ЗагрузкаДанныхОхотников/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	Если Объект.Охотхозяйство.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация, данные которой загружаются в базу");
		Возврат;
	КонецЕсли;
	
	Если ЗагрузитьНаСервере() Тогда
		ПоказатьПредупреждение(,"Загрузка завершена",10);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	
	ВрТаб = РеквизитФормыВЗначение("ТаблицаФайла");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВрТаб.ОхотникНаименование,
	|	ВрТаб.Фамилия,
	|	ВрТаб.Имя,
	|	ВрТаб.Отчество,
	|	ВрТаб.ДатаРождения,
	|	ВрТаб.НаселенныйПункт,
	|	ВрТаб.Улица,
	|	ВрТаб.Дом,
	|	ВрТаб.Квартира,
	|	ВрТаб.Телефон,
	|	ВрТаб.СерияГБ,
	|	ВрТаб.НомерГБ,
	|	ВрТаб.ДатаВыдачи,
	|	ВрТаб.СерияЧБ,
	|	ВрТаб.НомерЧБ,
	|	ВрТаб.ДатаРегистрации КАК ДатаВыдачиЧБ,
	|	ВрТаб.КемВыдан
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	&ВрТаб КАК ВрТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.ОхотникНаименование,
	|	ВТ1.ДатаРождения,
	|	ЕСТЬNULL(Охотники.Ссылка, ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка)) КАК Охотник,
	|	ЕСТЬNULL(Охотхозяйства.Ссылка, ЗНАЧЕНИЕ(Справочник.Охотхозяйства.ПустаяСсылка)) КАК ОхотхозяйствоКемВыдан
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Охотники КАК Охотники
	|		ПО ВТ1.ОхотникНаименование = Охотники.Наименование
	|			И (ВЫБОР
	|					КОГДА ВТ1.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|							И Охотники.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ1.ДатаРождения = Охотники.ДатаРождения
	|				КОНЕЦ
	|				ИЛИ ВТ1.НомерГБ = Охотники.НомерГосБилета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Охотхозяйства КАК Охотхозяйства
	|		ПО ВТ1.КемВыдан = Охотхозяйства.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ2.Охотник,
	|	ЕСТЬNULL(ГосБилеты.Серия, """") КАК СерияГБВБазе,
	|	ЕСТЬNULL(ГосБилеты.Номер, """") КАК НомерГБВБазе,
	|	ЕСТЬNULL(ГосБилеты.ДатаВыдачи, """") КАК ДатаВыдачиВБазе,
	|	ЕСТЬNULL(ЧленскиеБилеты.Серия, """") КАК СерияЧБВБазе,
	|	ЕСТЬNULL(ЧленскиеБилеты.Номер, """") КАК НомерЧБВБазе,
	|	ЕСТЬNULL(ЧленскиеБилеты.ДатаВыдачи, """") КАК ДатаВыдачиЧБВБазе,
	|	ЕСТЬNULL(ЧленскиеБилеты.КемВыдан, """") КАК КемВыданВБазе,
	|	ВТ1.ОхотникНаименование,
	|	ВТ1.Фамилия КАК Фамилия,
	|	ВТ1.Имя КАК Имя,
	|	ВТ1.Отчество,
	|	ВТ1.ДатаРождения,
	|	ВТ1.НаселенныйПункт,
	|	ВТ1.Улица,
	|	ВТ1.Дом,
	|	ВТ1.Квартира,
	|	ВТ1.Телефон,
	|	ВТ1.СерияГБ,
	|	ВТ1.НомерГБ,
	|	ВТ1.ДатаВыдачи,
	|	ВТ1.СерияЧБ,
	|	ВТ1.НомерЧБ,
	|	ВТ1.ДатаВыдачиЧБ,
	|	ВТ1.КемВыдан,
	|	ВТ2.ОхотхозяйствоКемВыдан
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты.СрезПоследних(
	|					&ДатаЗагрузки,
	|					ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ГосБилет)
	|						И Охотник В
	|							(ВЫБРАТЬ
	|								А.Охотник
	|							ИЗ
	|								ВТ2 КАК А
	|							ГДЕ
	|								А.Охотник <> ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка))) КАК ГосБилеты
	|			ПО (ВЫБОР
	|					КОГДА ВТ2.Охотник <> ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка)
	|						ТОГДА ВТ2.Охотник = ГосБилеты.Охотник
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты.СрезПоследних(
	|					&ДатаЗагрузки,
	|					ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
	|						И Охотник В
	|							(ВЫБРАТЬ
	|								А.Охотник
	|							ИЗ
	|								ВТ2 КАК А
	|							ГДЕ
	|								А.Охотник <> ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка))) КАК ЧленскиеБилеты
	|			ПО (ВЫБОР
	|					КОГДА ВТ2.Охотник <> ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка)
	|						ТОГДА ВТ2.Охотник = ЧленскиеБилеты.Охотник
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|		ПО ВТ1.ОхотникНаименование = ВТ2.ОхотникНаименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Фамилия,
	|	Имя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ2.Охотник
	|ИЗ
	|	ВТ2 КАК ВТ2
	|ГДЕ
	|	ВТ2.Охотник <> ЗНАЧЕНИЕ(Справочник.Охотники.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ВрТаб",ВрТаб);
	Запрос.УстановитьПараметр("ДатаЗагрузки",ТекущаяДата());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	НачатьТранзакцию();
	
	Если НЕ РезультатЗапроса[3].Пустой() Тогда
		
		Охотники = РезультатЗапроса[3];
		
		Блок = Новый БлокировкаДанных;
		ЭлБлока = Блок.Добавить("РегистрСведений.ОхотничьиБилеты");
		ЭлБлока.ИсточникДанных = Охотники;
		ЭлБлока.ИспользоватьИзИсточникаДанных("Охотник","Охотник");
		
		ЭлБлока = Блок.Добавить("РегистрСведений.КонтактнаяИнформация");
		ЭлБлока.ИсточникДанных = Охотники;
		ЭлБлока.ИспользоватьИзИсточникаДанных("Охотник","Охотник");
		
		Блок.Заблокировать();
	КонецЕсли;
	
	
	
	
	Выборка = РезультатЗапроса[2].Выбрать();
	
	НаборОБ = РегистрыСведений.ОхотничьиБилеты.СоздатьНаборЗаписей();
	НаборОБ.ОбменДанными.Загрузка = Истина;
	
	НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	ГосБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет");
	ЧленскийБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет");
	МПР = Справочники.ОрганыВыдачиГосБилетов.НайтиПоНаименованию("МПР");
	ЗарегистрированВ = Объект.Охотхозяйство;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	Таблица.Колонки.Добавить("Значение",Новый ОписаниеТипов("СправочникСсылка.Охотхозяйства"));

	СтруктураПараметровДанных = Новый Структура;
	СтруктураПараметровДанных.Вставить("НаборОБ",НаборОБ);
	СтруктураПараметровДанных.Вставить("НаборКИ",НаборКИ);
	СтруктураПараметровДанных.Вставить("ГосБилет",ГосБилет);
	СтруктураПараметровДанных.Вставить("ЧленскийБилет",ЧленскийБилет);
	СтруктураПараметровДанных.Вставить("МПР",МПР);
	СтруктураПараметровДанных.Вставить("ЗарегистрированВ",ЗарегистрированВ);
	СтруктураПараметровДанных.Вставить("Таблица",Таблица);
	
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Охотник.Пустая() Тогда
			
			Охотник = СоздатьОхотника(Выборка,ЗарегистрированВ);
			
			Если Охотник.Пустая() Тогда
				Продолжить;
			КонецЕсли;	
			
			ЗаписатьДанныеОхотника(Охотник,Выборка,СтруктураПараметровДанных,Ложь);
			
		Иначе
			эл = Выборка.Охотник.ПолучитьОбъект();
			Охотник = СоздатьОхотника(Выборка,ЗарегистрированВ,эл);

			ЗаписатьДанныеОхотника(Выборка.Охотник,Выборка,СтруктураПараметровДанных,Истина);	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеОхотника(Охотник, Выборка,СтруктураПараметровДанных,БылВБазе)
		
	НаборОБ 			= СтруктураПараметровДанных.НаборОБ;
	НаборКИ 			= СтруктураПараметровДанных.НаборКИ;
	ГосБилет 			= СтруктураПараметровДанных.ГосБилет;
	ЧленскийБилет 		= СтруктураПараметровДанных.ЧленскийБилет;
	МПР 				= СтруктураПараметровДанных.МПР;
	ЗарегистрированВ 	= СтруктураПараметровДанных.ЗарегистрированВ;
	Таблица				= СтруктураПараметровДанных.Таблица;
	
	НаборОБ.Отбор.Сбросить();
	НаборОБ.Отбор.Охотник.Установить(Охотник);
	НаборОБ.Отбор.ВидБилета.Установить(ГосБилет);	
		
	Если ПустаяСтрока(Выборка.СерияГБ) Тогда
		НаборОБ.Очистить();
		НаборОБ.Записать();
	Иначе
		НаборОБ.Отбор.Действует.Установить(Истина);	
		НаборОБ.Прочитать();
	КонецЕсли;	
	
	                        	
	НаборКИ.Отбор.Сбросить();
	НаборКИ.Отбор.Охотник.Установить(Охотник);
	НаборКИ.Прочитать();	

	
	Если БылВБазе Тогда	
		
		Если НаборОБ.Количество() > 0 Тогда
			Запись = НаборОБ[НаборОБ.Количество() - 1];
		ИначеЕсли НЕ ПустаяСтрока(Выборка.СерияГБ) Тогда
			Запись = НаборОБ.Добавить();
		КонецЕсли;	
		
		
		Если НаборКИ.Количество() > 0 Тогда
			ЗаписьКИ = НаборКИ[0];
		Иначе
			ЗаписьКИ = НаборКИ.Добавить();	
		КонецЕсли;	
		
	Иначе
		Запись = НаборОБ.Добавить();	
		ЗаписьКИ = НаборКИ.Добавить();
	КонецЕсли;
		
	Запись.Охотник = Охотник;
	Запись.ВидБилета = ГосБилет;
	Запись.Действует = Истина;
	Запись.ЗарегистрированВ = МПР;
	Запись.ДатаВыдачи = Выборка.ДатаВыдачи;
	Запись.Серия = Выборка.СерияГБ;
	Запись.Номер = Выборка.НомерГБ;
	Запись.Период = ТекущаяДата();
	
	НаборОБ.Записать();
	
	Если НЕ ПустаяСтрока(Выборка.СерияЧБ) Тогда
		
		НаборОБ.Отбор.Сбросить();
		НаборОБ.Отбор.Охотник.Установить(Охотник);
		НаборОБ.Отбор.ВидБилета.Установить(ЧленскийБилет);
		НаборОБ.Отбор.Действует.Установить(Истина);
		
		НаборОБ.Прочитать();
		
		Если БылВБазе Тогда	
			
			Если НаборОБ.Количество() > 0 Тогда
				Запись = НаборОБ[НаборОБ.Количество() - 1];
			Иначе
				Запись = НаборОБ.Добавить();
			КонецЕсли;	
			
		Иначе
			Запись = НаборОБ.Добавить();	
		КонецЕсли;
		
		Если Выборка.ОхотхозяйствоКемВыдан.Пустая() Тогда
			КемВыдан = СоздатьОхотхозяйство(Выборка.КемВыдан,Таблица);
		Иначе
			КемВыдан = Выборка.ОхотхозяйствоКемВыдан;
		КонецЕсли;	
		
		Запись.Охотник = Охотник;
		Запись.ВидБилета = ЧленскийБилет;
		Запись.Действует = Истина;
		Запись.ЗарегистрированВ = ЗарегистрированВ;
		Запись.КемВыдан = КемВыдан;
		Запись.ДатаВыдачи = Выборка.ДатаВыдачиЧБ;
		Запись.Серия = Выборка.СерияЧБ;
		Запись.Номер = Выборка.НомерЧБ;
		Запись.Период = ТекущаяДата();
		
		НаборОБ.Записать();
	КонецЕсли;	
		
	ЗаписьКИ.Охотник = Охотник;
	ЗаписьКИ.Город = Выборка.НаселенныйПункт;
	ЗаписьКИ.Улица = Выборка.Улица;
	ЗаписьКИ.Дом = Выборка.Дом;
	ЗаписьКИ.Квартира = Выборка.Квартира;
	
	НаборКИ.Записать();
		
КонецПроцедуры	
	
&НаСервереБезКонтекста
Функция СоздатьОхотхозяйство(Наименование,ТаблицаОхотхозяйств)
	
	СтрокаТаблицы = ТаблицаОхотхозяйств.Найти(Наименование,"Наименование");
	
	Если СтрокаТаблицы <> Неопределено Тогда
		Возврат СтрокаТаблицы.Значение;
	Иначе
		эл = Справочники.Охотхозяйства.СоздатьЭлемент();
		эл.Наименование = Наименование;
		эл.Записать();
		СтрокаТаблицы = ТаблицаОхотхозяйств.Добавить();
		СтрокаТаблицы.Наименование = Наименование;
		СтрокаТаблицы.Значение = эл.Ссылка;
	КонецЕсли;	
	
	Возврат эл.Ссылка;
КонецФункции	
	
&НаСервереБезКонтекста
Функция СоздатьОхотника(Выборка,Зарегистрирован,ОхотникОбъект = Неопределено)
	Если ОхотникОбъект = Неопределено Тогда
		эл = Справочники.Охотники.СоздатьЭлемент();
	Иначе
		эл = ОхотникОбъект;
	КонецЕсли;
	
	эл.Фамилия = Выборка.Фамилия;
	эл.Имя = Выборка.Имя;
	эл.Отчество = Выборка.Отчество;
	эл.Наименование = Выборка.ОхотникНаименование;
	эл.ДатаРождения = Выборка.ДатаРождения;
	эл.Охотхозяйство = Зарегистрирован;
	
	эл.СерияГосБилета = Выборка.СерияГБ;
	эл.НомерГосБилета = Выборка.НомерГБ;
	эл.НомерТелефона = Выборка.Телефон;
	
	Попытка
		эл.ОбменДанными.Загрузка = Истина;
		эл.Записать();
	Исключение
		Возврат ПредопределенноеЗначение("Справочник.Охотники.ПустаяСсылка");	
	КонецПопытки;	
	
	Возврат эл.Ссылка;
КонецФункции	
	
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьВнешнийФайлОбработкаЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,,,ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВнешнийФайлОбработкаЗавершение(Результат, Адрес, ИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		АдресВременногоХранилища= Адрес;
		ДвоичныеДанные = ПолучитьИЗВременногоХранилища(Адрес);

		ИмяВыбранногоФайла 		= ИмяФайла;
		Объект.ИмяФайла = ИмяФайла;
		Расширение 				= ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяВыбранногоФайла));
		
		Если НЕ Расширение = "xlsx"  Тогда
			
			ТекстПредупреждения = НСтр("ru ='Импорт данных из файлов данного типа не поддерживается.'");
			ПоказатьПредупреждение(, ТекстПредупреждения); 
			Элементы.Прочитать.Доступность = Ложь
		Иначе
			Элементы.Прочитать.Доступность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл() 
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите файл",ЭтотОбъект.КлючУникальности,"Объект.ИмяФайла");
		Возврат;
	КонецЕсли;	
	ФормаДлительныеОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация");
	ЗагрузитьФайлСДаннымиВТаблицуЗначенийНаСервере();
	ФормаДлительныеОперации.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлСДаннымиВТаблицуЗначенийНаСервере()
	
	Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяВыбранногоФайла));
	
	ИмяВременногоФайла	= ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	Если ДвоичныеДанные = Неопределено Тогда
		
		Возврат;
		
	Иначе
		
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
	КонецЕсли;
	
	Таблица = ЗагрузитьДанныеФорматаExcel2007(ИмяВременногоФайла);
	Если НЕ ПроверитьТаблицу(Таблица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения файла");
		Элементы.Прочитать.Доступность = Истина;
		Элементы.Загрузить.Доступность = Ложь;
		Объект.ИмяФайла = "";
		Возврат;
	Иначе
		Элементы.Прочитать.Доступность = Ложь;
		Элементы.Охотхозяйство.Видимость = Истина;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Таблица,"ТаблицаФайла");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьТаблицу(Таблица)
	Отказ = Ложь;
	//1 Фамилия
	//2 Имя
	//3 Отчество
	//4 ДатаРождения
	//5 НаселенныйПункт
	//6 Улица
	//7 Дом
	//8 Квартира
	//9 Телефон
	//10 СерияГБ
	//11 НомерГБ
	//12 ДатаРегистрации
	//13 СерияЧБ
	//14 НомерЧБ
	//15 ДатаВыдачи
	//16 КемВыдан
	
	Если Таблица.Количество() = 0 Тогда
		ТекстОшибки = "Нет данных в файле";
		Отказ = Истина;
	КонецЕсли;	
	
	Если Таблица.Колонки.Количество() > 16 Тогда
		ТекстОшибки = "Количество колонок не совпадает с форматом";
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат НЕ Отказ;
	Иначе

		Таблица.Колонки[0].Имя = "Фамилия";
		Таблица.Колонки[1].Имя = "Имя";
		Таблица.Колонки[2].Имя = "Отчество";
		Таблица.Колонки[3].Имя = "СтрДатаРождения";
		Таблица.Колонки[4].Имя = "НаселенныйПункт";
		Таблица.Колонки[5].Имя = "Улица";
		Таблица.Колонки[6].Имя = "Дом";
		Таблица.Колонки[7].Имя = "Квартира";
		Таблица.Колонки[8].Имя = "Телефон";
		Таблица.Колонки[9].Имя = "СерияГБ";
		Таблица.Колонки[10].Имя = "НомерГБ";
		Таблица.Колонки[11].Имя = "СтрДатаРегистрации";
		Таблица.Колонки[12].Имя = "СерияЧБ";
		Таблица.Колонки[13].Имя = "НомерЧБ";
		Таблица.Колонки[14].Имя = "СтрДатаВыдачи";
		Таблица.Колонки[15].Имя = "КемВыдан";
		
		Таблица.Колонки.Добавить("ОхотникНаименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
		Таблица.Колонки.Добавить("ДатаРождения",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		Таблица.Колонки.Добавить("ДатаРегистрации",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		Таблица.Колонки.Добавить("ДатаВыдачи",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		
		МассивЦифр = ПолучитьМассивЦифр();
		
		Для каждого стр из Таблица Цикл	
			СтрНомерТелефона = "";
			НомерТелефона = стр.Телефон;
			
			Для поз = 1 по СтрДлина(НомерТелефона) Цикл
				
				ПроверяемыйСимвол = Сред(НомерТелефона,поз,1);
				
				Если МассивЦифр.Найти(ПроверяемыйСимвол) <> Неопределено Тогда
					СтрНомерТелефона = СтрНомерТелефона + ПроверяемыйСимвол;
				КонецЕсли;	
				Если ПроверяемыйСимвол = "," Тогда
					СтрНомерТелефона = СтрНомерТелефона + ", ";
				КонецЕсли;	
			КонецЦикла;	
			
			ОхотникНаименование = стр.Фамилия + " " + Стр.Имя + ?(НЕ ПустаяСтрока(стр.Отчество) , " " + стр.Отчество,"");
			стр.ОхотникНаименование = ОхотникНаименование;
			
			стр.ДатаРождения = ПолучитьДату(стр.СтрДатаРождения,ОхотникНаименование);
			стр.ДатаРегистрации = ПолучитьДату(стр.СтрДатаРегистрации,ОхотникНаименование);
			стр.ДатаВыдачи = ПолучитьДату(стр.СтрДатаВыдачи,ОхотникНаименование);
			стр.Телефон = СтрНомерТелефона;
		КонецЦикла;
		
		Таблица.Колонки.Удалить(Таблица.Колонки.СтрДатаРождения);
		Таблица.Колонки.Удалить(Таблица.Колонки.СтрДатаРегистрации);
		Таблица.Колонки.Удалить(Таблица.Колонки.СтрДатаВыдачи);
	КонецЕсли;		
	
	Возврат НЕ Отказ;	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьДату(стрДата,ОхотникНаименование)
	Дата = '19000101';	
	
	Если ПустаяСтрока(стрДата) Тогда
		Возврат Дата;
	КонецЕсли;
	
	Попытка
		
		мнстрДата = СтрЗаменить(стрДата,".",Символы.ПС);
		День = СтрПолучитьСтроку(мнстрДата,1);
		Месяц = СтрПолучитьСтроку(мнстрДата,2);
		Год = СтрПолучитьСтроку(мнстрДата,3);
		
		Если ПустаяСтрока(Год) И СтрДлина(Месяц) > 4 Тогда
			Год = Прав(Месяц,4);
			Месяц = Лев(Месяц,СтрДлина(Месяц) - 4);
		ИначеЕсли ПустаяСтрока(Месяц) И СтрДлина(Год) > 4 Тогда
			Год = Прав(Год,4);
			Месяц = Лев(Год,СтрДлина(Год) - 4);
		КонецЕсли;
		
		Если СтрДлина(Месяц) = 1 Тогда
			Месяц = "0" + Месяц;
		КонецЕсли;
		
		Если СтрДлина(День) = 1 Тогда
			День = "0" + День;
		КонецЕсли;	
		
		
		Дата = Дата(Год + Месяц + День);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не корректная дата " + стрДата + " у охотника " + ОхотникНаименование);	
	КонецПопытки;	
	
	Возврат Дата;
	
КонецФункции	                                   

&НаСервереБезКонтекста
Функция ПолучитьМассивЦифр()
	МассивЦифр = Новый Массив(10);
	
	МассивЦифр[0] = "0";
	МассивЦифр[1] = "1";
	МассивЦифр[2] = "2";
	МассивЦифр[3] = "3";
	МассивЦифр[4] = "4";
	МассивЦифр[5] = "5";
	МассивЦифр[6] = "6";
	МассивЦифр[7] = "7";
	МассивЦифр[8] = "8";
	МассивЦифр[9] = "9";
	
	Возврат МассивЦифр;
	
КонецФункции	
	
&НаСервереБезКонтекста
Функция ЗагрузитьДанныеФорматаExcel2007(ИмяВременногоФайла) Экспорт
	
	Файл = Новый Файл(ИмяВременногоФайла);
	Если НЕ Файл.Существует() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ФайлЭкзель = ИмяВременногоФайла;
	ВременныйКаталог = КаталогВременныхФайлов() + ПолучитьРазделительПути() + "excel2007";
	УдалитьФайлы(ВременныйКаталог);
	
	РаспаковатьФайл(ФайлЭкзель, ВременныйКаталог);
	
	ФайлСтрок = ВременныйКаталог + ПолучитьРазделительПути() + "xl" + ПолучитьРазделительПути() +"sharedStrings.xml";
	СписокСтрок = ПрочитатьСписокСтрок(ФайлСтрок);
	
	ФайлФорматов = ВременныйКаталог + ПолучитьРазделительПути() + "xl" + ПолучитьРазделительПути() +"styles.xml";
	СписокФорматов = ПрочитатьСписокФорматов(ФайлФорматов);
	
	НомерЛиста = 1;
	ФайлЛиста = ВременныйКаталог + ПолучитьРазделительПути() + "xl" + ПолучитьРазделительПути() + "worksheets" + ПолучитьРазделительПути() + "sheet" + НомерЛиста + ".xml";
	Файл = Новый Файл(ФайлЛиста);
	Если НЕ Файл.Существует() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	МассивБукв = ПолучитьМассивБукв();
	ДеревоДанных = ПолучитьДеревоДанных(ФайлЛиста);
	
	Таблица = Новый ТаблицаЗначений;
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150));
	
	Счетчик = 0;
	Колонки = ДеревоДанных.Строки.Найти("dimension", "Объект", Истина);
	Для Каждого Строка Из Колонки.Строки Цикл
		
		Если Строка.Объект = "ref" Тогда
			
			Диапозон = Строка.Значение;
			
			ИндексСимвола = СтрДлина(Диапозон);
			ИмяПоследнейКолонки = "";
			Пока ИндексСимвола > 0 Цикл
				
				СимволИзСтроки = Сред(Диапозон, ИндексСимвола, 1);
				ПозицияВМассиве = МассивБукв.Найти(СимволИзСтроки);
				Если ПозицияВМассиве <> Неопределено Тогда
					
					ИмяПоследнейКолонки = СимволИзСтроки + ИмяПоследнейКолонки;
					
				ИначеЕсли НЕ ПустаяСтрока(ИмяПоследнейКолонки) Тогда
					
					Прервать;
					
				КонецЕсли;
				
				ИндексСимвола = ИндексСимвола - 1;
				
			КонецЦикла;
			
			
			ПозицияВМассиве = МассивБукв.Найти(ИмяПоследнейКолонки);
			ПозицияВМассиве = ?(ПозицияВМассиве = Неопределено, 49, ПозицияВМассиве);
			Для Индекс = 0 По ПозицияВМассиве Цикл
				
				Таблица.Колонки.Добавить(МассивБукв[Индекс],ОписаниеТиповСтрока150);
				
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	СтрСтрок = ДеревоДанных.Строки.Найти("sheetData", "Объект", Истина);
	Для Каждого Строка Из СтрСтрок.Строки Цикл
		
		НоваяСтрока = Таблица.Добавить();
		
		Для Каждого Колонка Из Строка.Строки Цикл
			
			Если Колонка.Объект <> "c" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЗначениеЯчейки = Неопределено;
			
			СтрЗначение = Колонка.Строки.Найти("v", "Объект");
			Если СтрЗначение <> Неопределено Тогда
				
				ЗначениеЯчейки = СтрЗначение.Значение;
				
			КонецЕсли;
			
			ЯчейкаСодержитТекст = Ложь; 
			СтрЗначение = Колонка.Строки.Найти("t", "Объект");
			Если СтрЗначение <> Неопределено И СтрЗначение.Значение = "s" И ЗначениеЯчейки <> Неопределено Тогда
				
				ЯчейкаСодержитТекст = Истина; 
				Позиция = Число(ЗначениеЯчейки); 
				Если СписокСтрок.Количество() > Позиция Тогда
					
					ЗначениеЯчейки = СписокСтрок.Получить(Позиция).Значение;
					
				КонецЕсли;
				
			КонецЕсли;
			
			сОбъект = Колонка.Строки.Найти("s", "Объект");
			Если сОбъект <> Неопределено Тогда
				
				СтрЗначение = СтрокуВЧисло(Колонка.Строки.Найти("s", "Объект").Значение, -1);
				Если СтрЗначение >= 0 Тогда
					
					ИмяФормата = СписокФорматов.Получить(СтрЗначение);
					Если ИмяФормата = "Дата" ИЛИ ИмяФормата = "ДатаВремя" ИЛИ ИмяФормата = "Время" Тогда
						
						Если ЗначениеЗаполнено(ЗначениеЯчейки) И НЕ ЯчейкаСодержитТекст Тогда 
							
							ПозицияРазделителя = Найти(ЗначениеЯчейки, ".");
							Если ПозицияРазделителя > 0 Тогда 
								
								КоличествоДней = СтрокуВЧисло(Лев(ЗначениеЯчейки, ПозицияРазделителя - 1)) * 86400 - 2 * 86400;
								КоличествоСекунд = СтрокуВЧисло(Сред(ЗначениеЯчейки, ПозицияРазделителя + 1)) - 2 * 60;
								
							Иначе
								
								КоличествоДней = СтрокуВЧисло(ЗначениеЯчейки) * 86400 - 2 * 86400;
								КоличествоСекунд = 0;
								
							КонецЕсли;
							
							ПолученнаяДата = Дата(1900, 1, 1, 0, 0, 0) + КоличествоДней + КоличествоСекунд;
							Если ИмяФормата = "Дата" Тогда 
								
								ЗначениеЯчейки = Формат(ПолученнаяДата, "ДЛФ=D");
								
							ИначеЕсли ИмяФормата = "ДатаВремя" Тогда 
								
								ЗначениеЯчейки = Формат(ПолученнаяДата, "ДЛФ=DT");
								
							ИначеЕсли ИмяФормата = "Время" Тогда 
								
								ЗначениеЯчейки = Формат(ПолученнаяДата, "ДЛФ=T");
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						Если ИмяФормата = "Число" Тогда
							
							ПреобразованноеЗначение = СтрокуВЧисло(ЗначениеЯчейки);
							Если ТипЗнч(ПреобразованноеЗначение) = Тип("Число") Тогда
								
								ЗначениеЯчейкиЧисло = Формат(ПреобразованноеЗначение, "ЧРГ=''; ЧГ=0");
								Если ЗначениеЗаполнено(ЗначениеЯчейкиЧисло) Тогда
									
									ЗначениеЯчейки = ЗначениеЯчейкиЧисло;
									
								Иначе
									
									ЗначениеЯчейки = Формат(ЗначениеЯчейкиЧисло, "ЧРГ=''; ЧГ=0");
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
			СтрЗначение = Колонка.Строки.Найти("r", "Объект");
			Если СтрЗначение <> Неопределено Тогда
				
				ИмяКолонки = СтрЗначение.Значение;
				
			КонецЕсли;
			
			ИндексСтроки = Неопределено;
			Счетчик = МассивБукв.Количество();
			Пока Счетчик > 0 Цикл 
				
				Счетчик = Счетчик - 1;
				Если Найти(ИмяКолонки, МассивБукв[Счетчик])>0 Тогда
					
					ИндексСтроки = Счетчик;
					Счетчик = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НоваяСтрока[МассивБукв[ИндексСтроки]] = СокрЛП(ЗначениеЯчейки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	Возврат Таблица;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтрокуВЧисло(Знач Значение, ЗначениеПоУмолчанию = 0)
	
	Попытка
		
		Если Значение = Неопределено ИЛИ Значение ="0" Тогда
			
			// Представление значения по умолчанию обрабатываем отдельно
			Результат =ЗначениеПоУмолчанию;
			
		Иначе
			
			СтепеньЧисла = 0;
			Позиция = Найти(Значение, "E");
			Если Позиция > 0 Тогда
				СтепеньЧисла = Сред(Значение, Позиция + 1);
				Значение = Лев(Значение, Позиция - 1);
			КонецЕсли;
			
			ЦелевойТип = Новый ОписаниеТипов("Число");
			Результат = ЦелевойТип.ПривестиЗначение(Значение);
			
			Если СтепеньЧисла <> 0 Тогда
				Результат = Результат * Pow(10, СтепеньЧисла);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		Результат = Значение;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура РаспаковатьФайл(Файл, Каталог)
	
	ZipАрхив = Новый ЧтениеZipФайла;
	ZipАрхив.Открыть(Файл);
	ZipАрхив.ИзвлечьВсе(Каталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивБукв()
	МассивБукв = Новый Массив;
	МассивБукв.Добавить("A"); // 1
	МассивБукв.Добавить("B");
	МассивБукв.Добавить("C");
	МассивБукв.Добавить("D");
	МассивБукв.Добавить("E");
	МассивБукв.Добавить("F");
	МассивБукв.Добавить("G");
	МассивБукв.Добавить("H");
	МассивБукв.Добавить("I");
	МассивБукв.Добавить("J"); // 10
	МассивБукв.Добавить("K");
	МассивБукв.Добавить("L");
	МассивБукв.Добавить("M");
	МассивБукв.Добавить("N");
	МассивБукв.Добавить("O");
	МассивБукв.Добавить("P");
	МассивБукв.Добавить("Q");
	МассивБукв.Добавить("R");
	МассивБукв.Добавить("S");
	МассивБукв.Добавить("T"); // 20
	МассивБукв.Добавить("U");
	МассивБукв.Добавить("V");
	МассивБукв.Добавить("W");
	МассивБукв.Добавить("X");
	МассивБукв.Добавить("Y");
	МассивБукв.Добавить("Z");
	МассивБукв.Добавить("AA");
	МассивБукв.Добавить("AB");
	МассивБукв.Добавить("AC");
	МассивБукв.Добавить("AD"); // 30
	МассивБукв.Добавить("AE");
	МассивБукв.Добавить("AF");
	МассивБукв.Добавить("AG");
	МассивБукв.Добавить("AH");
	МассивБукв.Добавить("AI");
	МассивБукв.Добавить("AJ");
	МассивБукв.Добавить("AK");
	МассивБукв.Добавить("AL");
	МассивБукв.Добавить("AM");
	МассивБукв.Добавить("AN"); // 40
	МассивБукв.Добавить("AO");
	МассивБукв.Добавить("AP");
	МассивБукв.Добавить("AQ");
	МассивБукв.Добавить("AR");
	МассивБукв.Добавить("AS");
	МассивБукв.Добавить("AT");
	МассивБукв.Добавить("AU");
	МассивБукв.Добавить("AV");
	МассивБукв.Добавить("AW");
	МассивБукв.Добавить("AX"); // 50
	//МассивБукв.Добавить("AY");
	//МассивБукв.Добавить("AZ");
	
	Возврат МассивБукв;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьСписокСтрок(ФайлСтрок)
	
	//
	//::: УНФ. Взять из БСП после исправления ошибки парсинга XML (СППР 00034078)
	//
	
	Строки 					= Новый СписокЗначений;
	ЭлементСпискаЗначений	= Неопределено;
	ПроверкаНаличияФайла	= Новый Файл(ФайлСтрок);
	
	Если ПроверкаНаличияФайла.Существует() Тогда
		
		_XML = Новый ЧтениеXML;
		_XML.ОткрытьФайл(ФайлСтрок);
		Пока _XML.Прочитать() Цикл
			
			Если _XML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				Если _XML.Имя = "sst" Тогда
					
					КоличествоЗаписей = _XML.ПолучитьАтрибут("uniqueCount"); // Количество полей (не используется на текущем этапе)
					
				ИначеЕсли _XML.Имя = "si" Тогда
					
					ЭлементСпискаЗначений = Строки.Добавить("");
					
				КонецЕсли;
				
			ИначеЕсли _XML.ТипУзла = ТипУзлаXML.Текст Тогда
				
				ЭлементСпискаЗначений.Значение = ЭлементСпискаЗначений.Значение + ?(ЗначениеЗаполнено(ЭлементСпискаЗначений.Значение), _XML.Значение, СокрЛ(_XML.Значение));
				
			КонецЕсли;
			
		КонецЦикла;
		_XML.Закрыть();
		
	КонецЕсли;
	
	Возврат Строки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДеревоДанных(Файл)
	
	ДеревоДанных = Новый ДеревоЗначений;
	ДеревоДанных.Колонки.Добавить("Объект");
	ДеревоДанных.Колонки.Добавить("Значение");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Файл);
	
	ТекЭлемент = Неопределено;
	ТекБаза = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			РежимЗагрузки = ЧтениеXML.Имя;
			
			Если ТекЭлемент = Неопределено Тогда
				ТекЭлемент = ДеревоДанных.Строки.Добавить();
				ТекЭлемент.Объект = РежимЗагрузки;
			Иначе
				ТекЭлемент = ТекЭлемент.Строки.Добавить();
				ТекЭлемент.Объект = РежимЗагрузки;					
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ТекЭлемент = Неопределено Тогда
				ТекЭлемент = Неопределено;
			Иначе
				ТекЭлемент = ТекЭлемент.Родитель;
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			ТекЭлемент.Значение = ЧтениеXML.Значение;
		КонецЕсли;
		
		Для Индекс = 0 По ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
			Строка = ТекЭлемент.Строки.Добавить();
			Строка.Объект = ЧтениеXML.ИмяАтрибута(Индекс);
			Строка.Значение = ЧтениеXML.ЗначениеАтрибута(Индекс);
		КонецЦикла;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ДеревоДанных;
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьСписокФорматов(ФайлФорматов)
	
	Хмл = Новый ЧтениеXML;
	Хмл.ОткрытьФайл(ФайлФорматов);
	ОписаниеФорматов = Новый Соответствие;
	
	Пока Хмл.Прочитать() Цикл
		// УНФ
		Если Хмл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Хмл.Имя = "cellXfs" Тогда
			
			Позиция = 0;
			Пока Хмл.Прочитать() Цикл 
				
				Если Хмл.ТипУзла = ТипУзлаXML.НачалоЭлемента и Хмл.Имя = "xf" Тогда
					
					// Описание формата даты http://social.msdn.microsoft.com/Forums/office/en-US/e27aaf16-b900-4654-8210-83c5774a179c/xlsx-numfmtid-predefined-id-14-doesnt-match?forum=oxmlsdk
					Если Хмл.ЗначениеАтрибута("numFmtId") <> Неопределено Тогда 
						
						ОписаниеФорматов.Вставить(Позиция, "Строка"); // Общий формат 0 берем как строку
						
						НомерФормата =  Число(Хмл.ЗначениеАтрибута("numFmtId"));
						Если НомерФормата > 0 И НомерФормата < 12 Тогда
							
							ОписаниеФорматов[Позиция] = "Число";
							
						ИначеЕсли НомерФормата > 13 И НомерФормата <= 17 Тогда
							
							ОписаниеФорматов[Позиция] = "Дата";
							
						ИначеЕсли НомерФормата >= 18 И НомерФормата <= 21 Тогда
							
							ОписаниеФорматов[Позиция] = "Время";
							
						ИначеЕсли НомерФормата = 22 Тогда
							
							ОписаниеФорматов[Позиция] = "ДатаВремя";
							
						ИначеЕсли НомерФормата >= 164 Тогда // Пользовательские форматы пока оставляем текстом, но необходимо смотреть по признакам.
							
							ОписаниеФорматов[Позиция] = "Строка";
							
						КонецЕсли;
						
					КонецЕсли;
					Позиция = Позиция + 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

		
	КонецЦикла;
	
	Хмл.Закрыть();
	
	Возврат ОписаниеФорматов;
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	ИмяВыбранногоФайла = Объект.ИмяФайла;
КонецПроцедуры

&НаКлиенте
Процедура ОхотхозяйствоПриИзменении(Элемент)
	Если Объект.Охотхозяйство.Пустая() Тогда
		Элементы.Загрузить.Доступность = Ложь;
	Иначе
		Элементы.Загрузить.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры
